In [1]:
import pandas as pd
import numpy as np

In [10]:
pokemon = pd.read_csv('Pokemon.csv')

In [11]:
pokemon.head(1)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False

Step 3 <a href='https://lab.karpov.courses/learning/85/module/1056/lesson/9045/26548/118051/'>link</a>
<br/>пробелы и точки нужно заменить на "_" (напр. Sp. Atk → sp_atk).
приведите все названия к нижнему регистру
колонку "#" переименовать в "id"
Полученные результаты запишите в исходный датафрейм pokemon.

Затем сгруппируйте данные по поколению покемонов (generation), и с помощью value_counts() посчитайте, сколько в каком поколении легендарных покемонов (legendary), а также сколько в этих поколениях нелегендарных покемонов. Полученный объект приведите к формату датафрейма (.to_frame()) и сохраните в legends.

In [12]:
pokemon = pokemon \
    .rename(columns=lambda c: c.replace('. ', '_').replace(' ', '_').lower()) \
    .rename(columns={'#':'id'})

In [13]:
pokemon.head()

,id,name,type_1,type_2,total,hp,attack,defense,sp_atk,sp_def,speed,generation,legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

In [14]:
legends = pokemon.groupby(by='generation') \
    .legendary \
    .value_counts() \
    .to_frame()

In [17]:
legends.head()

                      legendary_count
generation legendary
1          False                  160
           True                     6
2          False                  101
           True                     5
3          False                  142

Step 4 <a href='https://lab.karpov.courses/learning/85/module/1056/lesson/9045/26548/118052/'>link</a>
<br/>Как вы могли заметить,  есть только одна колонка со значениями, которая называется legendary, а в качестве индекса используются две колонки — generation и legendary. Два одинаковых названия — не очень хорошо, поэтому необходимо переименовать колонку legendary в legendary_count. 

Используйте датафрейм legends, полученный на предыдущем шаге, и измените в нём название столбца, перезаписав его в ту же переменную. Затем используйте unstack, чтобы поместить уровень индекса legendary в уровень оси столбцов. Иными словами, должно получиться две колонки – False & True. Результат сохраните в legends_unstacked.

In [16]:
legends = legends.rename(columns={'legendary':'legendary_count'})

In [19]:
legends_unstacked = legends.unstack()

Step 5 <a href='https://lab.karpov.courses/learning/85/module/1056/lesson/9045/26548/118053/'>link</a>
<br/>Немного усложним задачу. Теперь попробуем узнать, среди каких типов покемонов и какого поколения больше всего легендарных.

Сгруппируйте датасет pokemon по переменным generation и type_1, посчитайте количество легендарных покемонов внутри групп. Приведите данные в формат датафрейма, а затем используйте unstack(). В качестве ответа выберите вид и поколение покемона, среди которых больше всего легендарных.

Hint: обратиться к колонке с мультииндексом можно с помощью .loc[:,('legendary', True)]

In [45]:
pokemon.groupby(by=['generation', 'type_1']) \
    .legendary \
    .value_counts() \
    .to_frame() \
    .unstack() \
    .sort_values(('legendary', True), ascending=False) \
    .loc[:, ('legendary', True)].head(1)

generation  type_1
3           Dragon    6.0
Name: (legendary, True), dtype: float64

Step 7 <a href='https://lab.karpov.courses/learning/85/module/1056/lesson/9045/26548/118055/'>link</a>
<br>Преобразуйте представленные данные в длинный формат и запишите в переменную avocado_agg_long. В качестве индекса используйте type

In [46]:
avocado_agg = pd.DataFrame({'type' : ['conventional', 'organic'],
                            'AvgPrice_2015' : [1.077963, 1.673324],
                            'AvgPrice_2016' : [1.105595, 1.571684],
                            'AvgPrice_2017' : [1.294888, 1.735521],
                            'AvgPrice_2018' : [1.127886, 1.567176],
                            })
avocado_agg

           type  AvgPrice_2015  AvgPrice_2016  AvgPrice_2017  AvgPrice_2018
0  conventional       1.077963       1.105595       1.294888       1.127886
1       organic       1.673324       1.571684       1.735521       1.567176

In [48]:
pd.wide_to_long(df=avocado_agg, stubnames=['AvgPrice'], i='type', j='year', sep='_')

                   AvgPrice
type         year
conventional 2015  1.077963
organic      2015  1.673324
conventional 2016  1.105595
organic      2016  1.571684
conventional 2017  1.294888
organic      2017  1.735521
conventional 2018  1.127886
organic      2018  1.567176

Step 8 <a href='https://lab.karpov.courses/learning/85/module/1056/lesson/9045/26548/118056/'>link</a>
<br>⭐️ Имеется набор данных о супергероях в широком формате. В первой колонке Name находятся их имена, а остальные 167 столбцов — различные характеристики (суперсилы), принимающие значение либо True, либо False. Давайте преобразуем датафрейм так, чтобы "собрать" эти признаки в один столбец под названием superpower, а в качестве значений поместить туда списки имеющихся у того или иного героя суперсил. 

То есть привести в следующий формат:

           Name                                         superpower
568  Spider-Man  [Reflexes, Animal Oriented Powers, Danger Sens...

Сначала приведите данные к длинному формату, где единственным идентификатором будет имя героя Name. Новый столбец с названиями суперсил переименуйте в superpower. Полученный датафрейм запишите в superheroes_long.

Для того, чтобы соединить силы в списки и привести данные в желаемую форму, отфильтруйте колонку value так, чтобы остались строки только со значением True. Сгруппируйте датасет по Name, после чего возьмите столбец superpower и используйте .apply(list). Результат сохраните в superheroes_powers. Обратите внимание, что результирующий объект тоже должен быть датафреймом, а колонки должно быть всего две — Name и superpower.

In [55]:
sh_df = pd.read_csv('superheroes_power_matrix.csv')

In [70]:
superheroes_long = sh_df.melt(id_vars='Name', var_name='superpower')

In [72]:
superheroes_long.head()

          Name superpower  value
0      3-D Man    Agility   True
1       A-Bomb    Agility  False
2   Abe Sapien    Agility   True
3     Abin Sur    Agility  False
4  Abomination    Agility  False

In [76]:
superheroes_powers = superheroes_long.query('value == True') \
    .groupby(by='Name')\
    .superpower.apply(list) \
    .to_frame() \
    .reset_index()

In [77]:
superheroes_powers.head()

          Name                                         superpower
0      3-D Man    [Agility, Super Strength, Stamina, Super Speed]
1       A-Bomb  [Accelerated Healing, Durability, Longevity, S...
2   Abe Sapien  [Agility, Accelerated Healing, Cold Resistance...
3     Abin Sur                               [Lantern Power Ring]
4  Abomination  [Accelerated Healing, Intelligence, Super Stre...

Step 9 <a href='https://lab.karpov.courses/learning/85/module/1056/lesson/9045/26548/118057/'>link</a>
<br>Метод explode

Одно из нововведений в pandas версии 0.25.0 — метод explode(). Сначала создадим датафрейм из двух столбцов: колонку B заполним единичками, а в А запишем следующие элементы:

в две ячейки – списки, состоящие из нескольких элементов

In [78]:
df = pd.DataFrame({'A': [[1, 2, 3], 
                         'kitten', 
                         [], 
                         ['kitten', 'puppy']], 
                   'B': 1})
df

                 A  B
0        [1, 2, 3]  1
1           kitten  1
2               []  1
3  [kitten, puppy]  1

In [79]:
df.explode('A')

        A  B
0       1  1
0       2  1
0       3  1
1  kitten  1
2     NaN  1
3  kitten  1
3   puppy  1